using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class CommonWords : MonoBehaviour {
    private string[] comwords = { "ΑΚΟΜΗ" , "ΕΚΑΝΕ" , "ΚΑΠΟΙΟ" , "ΟΠΟΙΟ" , "ΠΡΟΣ",
                                    "ΑΛΛΑ" , "ΕΚΕΙ" , "ΚΑΤΙ" , "ΟΠΟΥ" , "ΠΡΩΤΗ",
                                    "ΑΝΑΜΕΣΑ" , "ΕΚΕΙΝΗ" , "ΚΑΤΩ" , "ΟΠΩΣ" , "ΠΩΣ",
                                    "ΑΠΟ" , "ΕΚΤΟΣ" , "ΛΕΕΙ" , "ΟΣΑ" , "ΣΗΜΕΡΑ",
                                    "ΑΡΓΟΤΕΡΑ" , "ΕΝΑ" , "ΛΙΓΟ" , "ΟΤΑΝ" , "ΣΠΙΤΙ",
                                    "ΑΥΤΟ" , "ΕΝΩ" , "ΛΟΙΠΟΝ" , "ΟΤΙ" , "ΣΧΕΔΟΝ",
                                    "ΑΦΟΥ" , "ΕΠΙΣΗΣ" , "ΜΑΖΙ" , "ΟΥΤΕ" , "ΤΕΛΟΣ",
                                    "ΒΡΙΣΚΟΤΑΝ" , "ΕΤΣΙ" , "ΜΕΓΑΛΗ" , "ΟΧΙ" , "ΤΙΠΟΤΑ",
                                    "ΓΕΓΟΝΟΣ" , "ΕΧΕΙ" , "ΜΕΣΑ" , "ΠΑΝΤΑ" , "ΤΟΣΟ",
                                    "ΓΙΑ" , "ΕΧΟΥΜΕ" , "ΜΕΤΑ" , "ΠΑΝΩ" , "ΤΟΤΕ",
                                    "ΓΙΑΤΙ" , "ΖΩΗ" , "ΜΕΤΑΞΥ" , "ΠΑΡΑ" , "ΤΡΟΠΟ",
                                    "ΓΙΝΕΤΑΙ" , "ΗΤΑΝ" , "ΜΕΧΡΙ" , "ΠΕΡΙΣΣΟΤΕΡΟ" , "ΤΩΡΑ",
                                    "ΔΕΝ" , "ΘΕΣΗ" , "ΜΗΤΕΡΑ" , "ΠΙΟ" , "ΥΠΑΡΧΕΙ",
                                    "ΔΗΛΑΔΗ" , "ΘΥΜΑΜΑΙ" , "ΜΟΝΟ" , "ΠΙΣΩ" , "ΦΑΙΝΕΤΑΙ",
                                    "ΔΥΟ" , "ΙΔΙΟ" , "ΜΠΟΡΕΙ" , "ΠΟΛΛΑ" , "ΦΟΡΑ",
                                    "ΕΓΙΝΕ" , "ΙΣΩΣ" , "ΜΠΟΡΟΥΣΕ" , "ΠΟΛΥ" , "ΧΘΕΣ",
                                    "ΕΔΩ" , "ΚΑΘΕ" , "ΝΕΑ" , "ΠΟΤΕ" , "ΧΡΟΝΙΑ",
                                    "ΕΙΝΑΙ" , "ΚΑΙ" , "ΟΛΑ" , "ΠΟΥ" , "ΧΩΡΙΣ",
                                    "ΕΙΠΕ" , "ΚΑΛΑ" , "ΟΜΑΔΑ" , "ΠΡΕΠΕΙ" , "ΩΡΑ",
                                    "ΕΙΧΕ" , "ΚΑΝΕΙ" , "ΟΜΩΣ" , "ΠΡΙΝ" , "ΩΣΤΕ", };

    private string word;
    // Use this for initialization
    void Start () {

    }
    public string getWord() {
        int index = Random.Range(0, comwords.Length);
        word = comwords[index];
        return word;
    }
	
	// Update is called once per frame
	void Update () {
		
	}
}
